[
    "$SPY Yield to rise near record highs before pulling back, 10 year back in uptrend, sequence ends between 5.1-5.2 $QQQ $NVDA $AAPL $TSLA",
    "$NVDA $GOOG $MSFT $QQQ  \nprobably nothin.. just largest econ in world shut to nvda",
    "$NVDA it is so easy to get blinded. More opportunities will come but protect your gains",
    "$NVDA is time for puts on this pig?",
    "$NVDA lol that was tiny😂",
    "$NVDA 1020 CLOSE?",
    "$NVDA again risk and reward. 5% upside and 50% downside lol 😂",
    "$AMD rumor has it that Lisa Su is applying for an analyst position at $NVDA",
    "$NVDA 800 soon (pre split)",
    "$NVDA at least 3 days rule holding it up. otherwise many many new bagholders. for the record, when tesla hit its peak like this it tank hard after split- just saying",
    "$SPY this looks like an exhausted rally.  No more buyers, even on $nvda earnings.  Perfect that $vix hit 2019 lows this morning to mark the occasion.",
    "$NVDA Its about to roll over",
    "$NVDA you can put 50 dollars even if it equals billions on top of this but you couldn&#39;t give a penny to sivbq...got it...",
    "$INTC $BB $AMD $META $NVDA  \nShhh! \nMarket is only interesting in bad news if it&#39;s about Intel.",
    "$NVDA a little profit taking,  nothing to be concerned with.",
    "$NVDA The homeless who cannot buy enoug shares or shares at all are the bears here. Cannot find one cognitvely unimpaired argument against buying. Esp with a stock split on the horizon!",
    "$NVDA 1500 very likely by 6/7",
    "$NVDA &gt;&gt; Hitting support  \n \n$SPY $QQQ $SMH",
    "$NVDA Knife emmm",
    "$NVDA i swear every one of you who bought today will regret it because major institutions are sucking you in  selling their stake  at the maximum",
    "$NVDA wait till the final hour. will be ripping some faces of the bears.",
    "$NVDA no😢😢😢😢😢",
    "$NVDA absorbed the whole market holy fuck",
    "$NVDA With those earnings it should be over 1100, market is very weak right now. Looks like the Fed is going to keep rates high until something breaks. Or higher. Cuts will be too late when they do finally decide to.",
    "$SXTP When volume hits watch out 🚀 TINY FLOAT $LEXX $JAGX $NVDA",
    "$NVDA ... the MACD does NOT LIE..",
    "$NVDA gonna drop to around 1k. Level 2 shows it. Not negative, just daily action, still going to rise until the 7th.",
    "$SPY 👀 $NVDA is sloping downwards now.",
    "$NVDA",
    "$NVDA what should be the strategy for it? Should we sell now and take profit and rebuy after the split? Or should we hang on?"
]